<template>
        <div class="panel panel-default">
            <div class="panel-heading">
                <h3 class="panel-title">课后交流</h3>
            </div>
            <div class="list-group">
                <a class="list-group-item notice-item" data-target="#xzy-notice1">
                    <h4 class="list-group-item-heading">项目完成秘籍交流<span class="label label-default">10月8日</span> <span class="label label-danger"></span> </h4>
                    <p class="list-group-item-text">畅所欲言所做项目体会</p>
                </a>
                <div class="panel-body xzy-notice-body" id="xzy-notice1">&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbspHTML5在网页开发上，赋予网页更好的意义和结构，更加丰富的标签将随着对RDFa的，微数据与微格式等方面的支持，构建对程序、对用户都更 有价值的数据驱动的Web。北京恒泰博远软件开发公司对HTML5的解释是，为开发者提供了一个跨平台的移动apps开发方案，并且该方案具有很好的扩展 性和灵活性。
                                                                                                                           　　由目前it行业使用html5 开发app来看，如今国内使用html5开发app应用技术尚有欠缺，因为在手机开发app上，html5应用只有两种方法，要不就是全使用HTML5的语法，要不就是仅使用JavaScript引擎。
                                                                                                                           　　JavaScript引擎的构建方法让制作手机网页游戏成为可能。由于界面层很复杂，已预订了一个UI工具包去使用。
                                                                                                                           　　纯HTML5手机应用运行缓慢并错漏百出，但优化后的效果会好转。尽管不是很多人愿意去做这样的优化，但依然可以去尝试。
                                                                                                                           　　HTML5手机应用的最大优势就是可以在网页上直接调试和修改。原生应用的开发人员可能需要花费非常大的力气才能达到HTML5的效果，不断地重复编码、调试和运行，这是首先得解决的一个问题。<br>
                </div>
                <a class="list-group-item notice-item" data-target="#xzy-notice2">
                    <h4 class="list-group-item-heading">网页开发技巧讲解 <span class="label label-default">10月5日</span> <span class="label label-danger">GX</span> </h4>
                    <p class="list-group-item-text">着重介绍html5和js</p>
                </a>
                <div class="panel-body xzy-notice-body" id="xzy-notice2">
                   &nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp1. 一定要闭合HTML标签
                                                                在以往的页面源代码里，经常看到这样的语句：

                                                                <li>Some text here.
                                                                <li>Some new text here.
                                                                <li>You get the idea.
                                                                也许过去我们可以容忍这样的非闭合HTML标签，但在今天的标准来看，这是非常不可取的，是必须百分百避免的。一定要注意闭合你的HTML标签，否则将无法通过验证，并且容易出现一些难以预见的问题。
                                                                最好使用这样的形式：

                                                                <ul>
                                                                <li>Some text here. </li>
                                                                <li>Some new text here. </li>
                                                                <li>You get the idea. </li>
                                                                </ul>
                                                                2. 声明正确的文档类型( DocType )
                                                                笔者早先曾加入过许多CSS论坛，在那里，如果有用户遇到问题，我们会建议他首先做两件事：
                                                                1. 验证CSS文件，解决所有可见的错误
                                                                2. 加上文档类型 Doctype
                                                                DOCTYPE 定义在HTML标签出现之前，它告诉浏览器这个页面包含的是HTML，XHTML，还是两者混合出现，这样浏览器才能正确的解析标记。3. 不要使用嵌入式CSS样式
                                                                                                                                       当你在埋头写代码时，可能会经常顺手或偷懒的加上一点嵌入式css代码，就象这样：

                                                                                                                                       <p style="color: red;"></p>
                                                                                                                                       这样看起来即方便又没有问题，但是它会在你得代码中产生问题。
                                                                                                                                       在你开始写代码时，最好是在内容结构完成之后再开始加入样式代码。
                                                                                                                                       这样的编码方式就像打游击，是一种很山寨的做法。——Chris Coyier
                                                                                                                                       更好的做法是，把这个P的样式定义在样式表文件里：

                                                                                                                                       someElement > p {
                                                                                                                                       color: red;
                                                                                                                                       }
                                                                                                                                       4. 在页面head标签中引入所有的样式表文件
                                                                                                                                       理论上讲，你可以在任何位置引入CSS样式表，但HTML规范建议在网页的head标记中引入，这样可以加快页面的渲染速度。
                                                                                                                                       在雅虎的开发过程中，我们发现，在head标签中引入样式表，会加快网页加载速度，
                                                                                                                                       因为这样可以使页面逐步渲染。

                                                                                                                                       <head>
                                                                                                                                       <title>My Favorites Kinds of Corn</title>
                                                                                                                                       <link rel="stylesheet" type="text/css" media="screen" href="path/to/file.css" />
                                                                                                                                       <link rel="stylesheet" type="text/css" media="screen" href="path/to/anotherFile.css" />
                                                                                                                                       </head><br>
                    </div>

                <a class="list-group-item notice-item" data-target="#xzy-notice3">
                    <h4 class="list-group-item-heading">快速学习文档与资料方法 <span class="label label-default">10月4日</span> <span class="label label-danger">NYX</span> </h4>
                    <p class="list-group-item-text">快速学习文档方法介绍</p>
                </a>
                <div class="panel-body xzy-notice-body" id="xzy-notice3">
                    &nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp 快速学习法是日本出现的一种新的学习方法，它能使人们以高于常法五倍的速度灵活、迅速地掌握知识。人们都有这样的经验，一件难记的事情或一道难解的数学题，若是你有意识地向别人讲述几遍，就能大大地加深印象，易于记住或理出头绪。恐怕这个经验教师最有体会，教师讲课时，为了向学生说明白，脑筋在紧张地活动，所讲的知识在这个过程中得以强化，并得到了整理，使其条理化、清晰化了。     快速学习法正是根据这个原理展开学习的。在用这种方法学习时，先不要求完全理解，而是拿到教材后，直接根据目录和提示，调动自己已有的知识，猜测性地作自我讲授，讲完后才打开书本，进行第一次通读。第一次通读可以检验第一次自我讲授的不足之处，谬误所在都会跃然纸上，使你体会颇深。然后你就可以用自己的语言编制出一张适用的目录一览表，对照它进行第二次自我讲授，这次讲授会明显地感到自己比第一次比较准确有条理。接着再通读第二次，这次通读会获得更深的感受。当你进行第三次自我讲授时，你会讲得更完善、更丰富，许多模糊的地方变得清晰起来，最后再来一次通读，可快速浏览，作一系统总结，感到知识都已清楚地反映在大脑之中。经过三到四个回合的自我讲授、通读、精读、粗读后，你就能得心应手地掌握所要学习的知识。<br>
                                    </div>
                 <a class="list-group-item notice-item" data-target="#xzy-notice4">
                    <h4 class="list-group-item-heading">tower使用心得体会 <span class="label label-default">10月1日</span> <span class="label label-danger">XZY</span> </h4>
                    <p class="list-group-item-text">tower 使用技巧和方法介绍</p>
                 </a>
                 <div class="panel-body xzy-notice-body" id="xzy-notice4">
                   &nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsptower.im作为一个轻量SaaS应用，强调简单、好用。应用分：项目、回顾、日历、团队、统计、我自己 六部分。右上角提供全局搜索和个人设置。

                                                                     项目：以任务列表分组，任务为最小单元，可基于任务建立对应的讨论和文件分享。
                                                                     回顾：相当于按时间排序的所有人的动作清单，可做历史追溯用，感觉不过意义不大。领导或上级也许更关心“每日进展”。
                                                                     日历：待办任务基于台历形式的展示，辅助功能。
                                                                     团队：项目团队人员的管理界面，可以把成员按部门分组，分为“管理员、成员、访客”三种角色。访客比较适合关注项目进展的PM、部门经理及以上领导使用。
                                                                     统计：列出任务延误情况和成员的延误情况。
                                                                     我自己：这个功能比较赞，相当于是个人面板，能看到被分配到的任务（可标为正在处理，便于其他成员了解进展）、星标（即个人收藏，限文档、文件）。

                                                                     任何软件都是辅助，关键还是团队里的人和项目组织。当然面对面的沟通是最高效和直接的，如果缺乏这种条件时，电话/视频会议，桌面共享演示（Webex）对增加大家对项目的理解都很有帮助。使用tower.im的几个建议：

                                                                     项目目标清晰，开发任务明确（至少第一个迭代周期的任务明确）
                                                                     团队成员认同任务，责任清晰、时间有限
                                                                     适合规模中小、几个月周期的项目管理，个人任务不太适合用作缺陷管理（缺陷管理可用JIRA或Terllo）
                                                                     tower.im带来的帮助：

                                                                     项目情况透明化（项目成员都能看到）、扁平化管理（非上下级单线）
                                                                     减少大部头项目文档放到SVN中（太重），大家开发时都不愿看。但需把讨论中结论、规则等成果性内容标星或纳入在线文档中管理。
                                                                     个人工作任务清晰明确，方便统计。（下一步可统计工时）
                                                                     任务延期、讨论可设置邮件提醒相关人<br>
                                    </div>
                 <a class="list-group-item notice-item" data-target="#xzy-notice5">
                     <h4 class="list-group-item-heading">SCRUM探讨与交流 <span class="label label-default">9月30日</span> <span class="label label-danger">ZXH</span> </h4>
                     <p class="list-group-item-text">SCRUM介绍及应用前景</p>
                 </a>
                 <div class="panel-body xzy-notice-body" id="xzy-notice5">
                    &nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp  Scrum是迭代式增量软件开发过程，通常用于敏捷软件开发。Scrum包括了一系列实践和预定义角色的过程骨架。Scrum中的主要角色包括同项目经理类似的Scrum主管角色负责维护过程和任务，产品负责人代表利益所有者，开发团队包括了所有开发人员。虽然Scrum是为管理软件开发项目而开发的，它同样可以用于运行软件维护团队，或者作为计划管理方法：Scrum of Scrums.
                    Scrum过程
                    Scrum是一个包括了一系列的实践和预定义角色的过程骨架（是一种流程、计划、模式，用于有效率地开发软件）。Scrum中的主要角色包括同项目经理类似的Scrum主管角色负责维护过程和任务，产品负责人代表利益所有者，开发团队包括了所有开发人员。
                    在每一次冲刺（一个15到30 天周期 ，长度由开发团队决定），开发团队创建可用的（可以随时推出）软件的一个增量。每一个冲刺所要实现的特性来自产品订单（product backlog，我觉得翻译成“产品目标”更恰当）， 产品订单（产品目标）是指按照优先级排列的需要完成的工作的概要的需求（目标）。哪些订单项（目标项目）会被加入一次冲刺，由冲刺计划会议决定。 在会议中，产品负责人告诉开发团队他需要完成产品订单中的哪些订单项。开发团队决定在下一次冲刺中他们能够承诺完成多少订单项。 在冲刺的过程中，没有人能够变更冲刺订单（sprint backlog），这意味着在一个冲刺中需求是被冻结的。
                    管理Scrum过程有很多实施方法，从白板上的即时贴到软件包。Scrum最大的好处是它非常容易学习，而且应用Scrum不需要太多的投入。
                    敏捷方法之极限编程(XP)和 Scrum区别[1]
                    区别之一： 迭代长度的不同
                    XP的一个Sprint的迭代长度大致为1~2周, 而Scrum的迭代长度一般为 2~ 4周。
                    区别之二: 在迭代中, 是否允许修改需求
                    XP在一个迭代中，如果一个User Story(用户素材, 也就是一个需求)还没有实现， 则可以考虑用另外的需求将其替换， 替换的原则是需求实现的时间量是相等的。而Scrum是不允许这样做的，一旦迭代开工会完毕, 任何需求都不允许添加进来，并有Scrum Master严格把关，不允许开发团队受到干扰。
                    区别之三: 在迭代中，User Story是否严格按照优先级别来实现
                    XP是务必要遵守优先级别的。但Scrum在这点做得很灵活，可以不按照优先级别来做，Scrum这样处理的理由是：如果优先问题的解决者，由于其它事情耽搁，不能认领任务，那么整个进度就耽误了。另外一个原因是，如果按优先级排序的User Story #6和#10，虽然#6优先级高，但是如果#6的实现要依赖于#10，则不得不优先做#10。
                    区别之四:软件的实施过程中，是否采用严格的工程方法，保证进度或者质量
                    Scrum没有对软件的整个实施过程开出工程实践的处方，要求开发者自觉保证。但XP对整个流程方法定义非常严格，规定需要采用TDD、自动测试、结对编程、简单设计、重构等约束团队的行为。
                    “猪”角色
                    猪是全身投入项目和Scrum过程的人； they are the ones with "their bacon on the line."
                    产品负责人代表了客户的意愿。这保证了Scrum团队在做从业务角度来说正确的事情。产品负责人编写用户故事，排出优先级，并放入产品订单。Scrum主管（或促进者）促进Scrum过程，他的主要工作是去除那些影响团队交付冲刺目标的障碍。Scrum主管并非团队的领导（由于他们是自我组织的），而是负责屏蔽外界对开发团队的干扰。Scrum主管确保Scrum过程按照初衷使用。Scrum主管是规则的执行者。开发团队负责交付产品的团队。由5至9名具有跨职能技能的人（设计者，开发者等）组成的小团队完成实际的开发工作。。
                    “鸡”角色
                    鸡角色并不是实际Scrum过程的一部分，但是必须考虑他们。敏捷方法的一个重要方面是使得用户和利益相关者参与到过程中的时间。参与每一个冲刺的评审和计划，并提供反馈对于这些人来说是非常重要的。
                    用户软件是为了某些人而创建！就像“假如森林里有一棵树倒下了，但没有人听到，那么它算发出了声音吗”，“假如软件没有被使用，那么它算是被开发出来了么？”利益所有者（客户，提供商）影响项目成功的人，只直接参与冲刺评审过程。经理为产品开发团体架起环境的那个人。
                    会议编辑
                    在冲刺中，每一天都会举行项目状况会议，被称为“scrum”或“每日站立会议”。每日站立会议有一些具体的指导原则：
                    会议准时开始。对于迟到者团队常常会制定惩罚措施（例如罚款，做俯卧撑，在脖子上挂橡胶鸡玩具）欢迎所有人参加，但只有"猪"可以发言。不论团队规模大小，会议被限制在15分钟。所有出席者都应站立。（有助于保持会议简短）会议应在固定地点和每天的同一时间举行。在会议上，每个团队成员需要回答三个问题：
                    今天你完成了哪些工作？明天你打算做什么？完成你的目标是否存在什么障碍？（Scrum主管需要记下这些障碍）
                    每一个冲刺完成后，都会举行一次冲刺回顾会议，在会议上所有团队成员都要反思这个冲刺。举行冲刺回顾会议是为了进行持续过程改进。会议的时间限制在4小时。
                    Scrum提倡所有团队成员坐在一起工作，进行口头交流，以及强调项目有关的规范（disciplines），这些有助于创造自我组织的团队。
                    Scrum的一个关键原则是承认客户可以在项目过程中改变主意，变更他们的需求，而预测式和计划式的方法并不能轻易地解决这种不可预见的需求变化。同样，Scrum采用了经验方法– 承认问题无法完全理解或定义，而是关注于如何使得开发团队快速推出和响应不断出现的需求的能力最大化。
                    文档编辑
                    产品订单
                    产品订单（product backlog）是整个项目的概要文档。产品订单包括所有所需特性的粗略的描述。产品订单是关于将要创建的什么产品。产品订单是开放的，每个人都可以编辑。产品订单包括粗略的估算，通常以天为单位。估算将帮助产品负责人衡量时间表和优先级（例如，如果"增加拼写检查"特性的估计需要花3天或3个月，将影响产品负责人对该特性的渴望）.
                    冲刺订单
                    冲刺订单（sprint backlog）是大大细化了的文档，包含团队如何实现下一个冲刺的需求的信息。任务被分解为以小时为单位，没有任务可以超过16个小时。如果一个任务超过16个小时，那么它就应该被进一步分解。冲刺订单上的任务不会被分派，而是由团队成员签名认领他们喜爱的任务。
                    燃尽图
                    燃尽图（burn down chart）是一个公开展示的图表，显示当前冲刺中未完成的任务数目，或在冲刺订单上未完成的订单项的数目。不要把燃尽图与挣值图相混淆。燃尽图可以使'冲刺(sprint)'平稳的覆盖大部分的迭代周期，且使项目仍然在计划周期内。
                    项目管理编辑
                    以下是一些Scrum的通用实践：
                    客户成为开发团队中的一部分。（例如客户肯定对开发的结果真正感兴趣。）和所有其他形式的敏捷软件过程一样，Scrum有频繁的包含可以工作的功能的中间可交付成果。这使得客户可以更早的得到可以工作的软件，同时使得项目可以变更项目需求以适应不断变化的需求。频繁的风险和缓解计划是由开发团队自己制定。– 在每一个阶段根据承诺进行风险缓解，监测和管理（风险分析）。计划和模块开发的透明 – 让每一个人知道谁负责什么，以及什么时候完成。频繁的进行所有相关人员会议，以跟踪项目进展 – 平衡的（发布，客户，员工，过程）仪表板更新 – 所有相关人员的变更 – 你必须拥有预警机制，例如提前了解可能的延迟或偏差。没有问题会被藏在地毯下。认识到或说出任何没有预见到的问题并不会受到惩罚。在工作场所和工作时间内必须全身心投入。– 完成更多的工作并不意味着需要工作更长时间。
                    术语编辑
                    下面是Scrum用到的术语:
                    角色
                    产品负责人 Product Owner： 负责维护产品订单的人，代表利益相关者的利益。
                    Scrum主管 Scrum Master： 为Scrum过程负责的人，确保scrum的正确使用并使得Scrum的收益最大化。一般不翻译。
                    开发团队 Team: 由负责自我管理开发产品的人组成的跨职能团队。
                    工件
                    产品订单 Product Backlog：按照优先级排序的高层需求。
                    冲刺订单 Sprint Backlog：要在冲刺中完成的任务的清单。
                    冲刺燃尽图 Burndown Chart：在冲刺长度上显示所有剩余工作时间逐日递减的图，因整体上总是递减而得名。
                    活动
                    计划会 Sprint Planning Meeting：在每个冲刺之初，由产品负责人讲解需求，并由开发团队进行估算的计划会议。
                    每日立会 Daily Standup Meeting：团队每天进行沟通的内部短会，因一般只有15分钟且站立进行而得名。
                    评审会 Review Meeting：在冲刺结束前给产品负责人演示并接受评价的会议。
                    反思会/回顾会 Retrospective Meeting：在冲刺结束后召开的关于自我持续改进的会议。
                    其他
                    冲刺 Sprint: 一个时间周期（通常在2周到1个月之间），开发团队会在此期间内完成所承诺的一组订单项的开发。
                    其他领域编辑
                    虽然Scrum最初只应用于软件开发，它也可以被成功地应用于其他产业。现在Scrum通常被认为是一种用于开发任何产品或管理人和工作的迭代式的，增量的过程。
                    用于产品开发
                    将Scrum应用于产品开发是在《"T新新产品开发游戏"》（哈佛商业评论 86116:137-146, 1986年）第一次提出，之后野中郁次郎和竹内弘高合著的《"创造知识的企业"》（牛津大学出版社，1995年）进行了详细的阐述。今天Scrum被用于开发金融产品，互联网产品，以及医药产品。
                    项目管理方法
                    由于市场营销通常以项目的方式运作，许多一般项目管理的原则应用在市场营销上。市场营销也可以像项目管理技术那样进行优化。以Scrum方法进行市场营销被认为有助于克服市场营销经理们所遇到的问题。短时和固定的会议对于小的市场营销团队来说很重要，这是因为团队的每一个成员都可以了解其他人在做些什么，以及整个团队在朝着什么方向前进。Scrum在市场营销中应用可以：
                    在早期发现可能的问题，可以更快地，最小损失地应对问题。 根据Scrum的主要原则 “没有问题被扫入地毯下”，Scrum鼓励每一个团队成员描述他所遇到的困难，而这个困难可能会对整个团队的工作造成影响。降低财务风险。 在每一个冲刺周期的开始，企业所有者可以不付出任何代价的改变任何市场营销的因素：包括增加投资以夸大顾客数量，减少投资直至未知风险被减轻，或用于支持其他活动。使得市场营销计划更灵活。采用冲刺的短期市场营销计划可以更加有效。如果一种促销方法在冲刺过程中显示无效，市场营销经理有机会将其换成另一种促销方法。向每一个团队成员说明每一个小的，但重要的任务的交付时间也变得更容易。使得客户以不同的方式参与。
<br>
                                    </div>

                 <a class="list-group-item notice-item" data-target="#xzy-notice6">
                     <h4 class="list-group-item-heading">交流技巧与任务分配心得经验 <span class="label label-default">9月25日</span> <span class="label label-danger">PYD </span> </h4>
                     <p class="list-group-item-text">任务分配心得经验介绍</p>
                 </a>
                 <div class="panel-body xzy-notice-body" id="xzy-notice6">
                    &nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp作为一个管理者可以在Linkwedo 领度企业执行与沟通平台中关注你的团队成员，可点击进入每个成员的空间，去了解他们的工作状况。在成员空间中可以看到该成员的个人简介、工作责任、项目、任务等概况，当然还有更多工作详细情况。

                                                                      1.    明确工作任务，提供任务列表

                                                                      工作围绕任务，管理者在做任务分配时，需要明确写下员工的工作任务详情，包含任务要求、任务目标、任务完成时间、指定任务执行人、任务汇报要求等，将工作任务分配给员工。让通过领度任务，能够让员工清晰了解任务详情，知道该做什么，该怎么做，何时做完等等细节，以利于员工有目标的去完成工作。这样在员工任务列表中就包含了所有要执行的任务、到期任务、即将执行的任务等。在Linkwedo的任务不是简单的待办事项，而是所有任务来源于项目，来源于项目目标的分解，所以在执行任务需要关注到整个项目的进度，提高对工作的积极性和责任感，督促自己和团队整体紧密合作，相互监督协作。

                                                                      2.   个人工作概览——月度时间评估

                                                                      根据杜拉克的观察，有效的经营者不从工作下手，而是从认识自己的时间运用开始，通过对时间的纪录与分析，将无效、没有生产力的时间区别出来，然后设法减少或简化不必要的工作，最后将零碎的时间重新组合，集中出一整段不受干扰的自由时间，从而使自己可以不间断地处理重要的工作。在Linkwedo中提供时间评估工具，并且时间统计采用自动统计而非人为统计的机制，通过时间相对比例的算法而非绝对时间的算法。在月度时间评估中呈现出员工每月花费到这些项目里面的时间百分比，并可展开查看这些时间里具体做了哪些工作。通过月度时间评估能够准确掌握员工每月的工作重点，也可评估出工作方向是否有偏差。

                                                                      3.   日程表——日报、周报

                                                                      Linkwedo的日程表具有双重作用，既可以自动收集工作汇报的内容，也可以填报每天的工作情况，避免了工作交流与工作总结的重复性，全面呈现工作动态。依此来及时了解员工每天及每周的工作，回顾历史记录，查看未来计划。

                                                                      4.    个人工作汇报——活动流记录

                                                                      个人活动流呈现了个人工作汇报信息，类似微博，员工随时随地发布的最新的工作动态，比如记录了刚刚完成了哪些工作，进行了哪些知识分享，或者是发表一个计划，一个待办事项，一个方案PPT等等。在发布每一条工作记录的时候，可以随时控制查阅权限，限制查看者人数，比如只选择在项目参与人群中可见、或者任务参与人群可见、或者私信给一个或两个人，再或者完全公开或完全私人。作为管理者可以对于有权限阅读的信息，是可以发表评论，也可以进行收藏，进行工作的沟通及指导。

                                                                      通过以上4点方法的实践，既可以对团队的工作进行有效的管理，也可以在做团队绩效考评时有数据依据，并且营造了一种平等，透明，信任，互助的工作氛围和团队文化。<br>
                                   </div>




            </div>
        </div>
</template>
<style>
    @import "GroupStudy.css";
    .xzy-notice-body{
        display: none;
    }
    .notice-item{
        cursor: pointer;
    }
    .label{
        float:right;
    }
    .xzy-img{
        max-width:100%;
    }
</style>
<script>
    var $ = window.$ = window.jQuery = require('jquery');
    var bootstrap = require('bootstrap');
    export default{
        data(){
            return{
                msg:'hello vue'
            }
        },
        mounted: function(){
            $('.notice-item').click(function (e) {
                let name = $(this)[0].getAttribute("data-target");
                if($(name).css("display") === "none"){
                    $(name).slideDown(300);
                }else {
                    $(name).slideUp(300);
                }
            });
        }
    }
</script>
